# SetWSCellBottomBN

## Description
Sets a bottom border with the specified attributes in specified worksheet cells.<BR>
<BR>
SetWSCellBottomBN allows borders to be set for a rectangular range of cells. To set the border formatting of a single cell, specify identical values for the top/bottom and left/right range boundaries.<BR>
<BR>
Note:<BR>
A rectangular range of cells is formatted as a single block of cells. If you apply a bottom border to the range of cells, the border is displayed only on the right edge of the cells.

```pascal
PROCEDURE SetWSCellBottomBN(
				worksheet   : HANDLE;
				topRow      : INTEGER;
				leftColumn  : INTEGER;
				bottomRow   : INTEGER;
				rightColumn : INTEGER;
				style       : LONGINT;
				weight      : INTEGER;
				color       : LONGINT);
```

```python
def vs.SetWSCellBottomBN(worksheet, topRow, leftColumn, bottomRow, rightColumn, style, weight, color):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|worksheet|HANDLE|Worksheet on which function is to operate.|
|topRow|INTEGER|Top row of range to set.|
|leftColumn|INTEGER|Left column of range to set.|
|bottomRow|INTEGER|Bottom row of range to set.|
|rightColumn|INTEGER|Right column of range to set.|
|style|LONGINT|Border line style to be set.(0 = None; 2 = Solid; for dashed, use negative value of Internal Index of dash line type|
|weight|INTEGER|Border line weight to be set.(in Mils)|
|color|LONGINT|Border line color to be set. (color index: 0..255)|

## Examples
```pascal
colFormula := 'Layer';
SetWSCellFormula(WSHan,2,theCol,2,theCol,colFormula);
SetWSCellFormula(WSHan,3,theCol,3,theCol,'=L');
{Message(MsgTitle,CR,'Finding Cables');}
SetWSCellBottomBN(WSHan,2,1,2,NumDisplayFields+2,2,15,255);
SetWSCellTextFormat(WSHan,2,1,2,NumDisplayFields+2,fontIndex,14,1 );
SetWSCellAlignment(WSHan,1,1,3,NumDisplayFields+2,2);

{	Message(MsgTitle,CR,'Finding Cables');}
	SetWSCellBottomBN(WSHan, 2, 1, 2, NumDisplayFields+2, 2, 15, 255);
	SetWSCellTextFormat(WSHan, 1, 1, 2, NumDisplayFields+2, fontIndex, 14, 1);
	SetWSCellAlignment(WSHan, 1, 1, 3, NumDisplayFields+2, 2);

colFormula := 'Layer';
SetWSCellFormula(WSHan,2,theCol,2,theCol,colFormula);
SetWSCellFormula(WSHan,3,theCol,3,theCol,'=L');
{Message(MsgTitle,CR,'Finding Cables');}
SetWSCellBottomBN(WSHan,2,1,2,NumDisplayFields,2,15,255);
SetWSCellTextFormat(WSHan,2,1,2,NumDisplayFields,fontIndex,14,1 );
SetWSCellAlignment(WSHan,1,1,3,NumDisplayFields,2);
```
```python
import vs

# Sets a bottom border with the specified attributes in specified worksheet
# cells.
worksheet = vs.GetObject('MyWorksheet')  # handle to a worksheet
topRow = 10
leftColumn = 5
bottomRow = 10
rightColumn = 5
style = 0
weight = 1
color = 5

vs.SetWSCellBottomBN(worksheet, topRow, leftColumn, bottomRow, rightColumn, style, weight, color)
```

## Version
Availability: from Vectorworks 2019

## Category
* Worksheets